Revit 2024 API
PartUtils.GetSplittingCurves Method (Document, ElementId)
 Identifies the curves that were used to create the part.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2019.1
Syntax
C#
public static IList<Curve> GetSplittingCurves(
	Document document,
	ElementId partId
)
Visual Basic
Public Shared Function GetSplittingCurves ( _
	document As Document, _
	partId As ElementId _
) As IList(Of Curve)
Visual C++
public:
static IList<Curve^>^ GetSplittingCurves(
	Document^ document,
	ElementId^ partId
)
Parameters
document
Type: Autodesk.Revit.DB.Document
 The source document of the part.
partId
Type: Autodesk.Revit.DB.ElementId
 The part id.
Return Value
 The curves that created the part. Empty if partId is not a Part or Part is not divided.
Examples
CopyC#
public void GetCurveDividers(Part part)
{
   StringBuilder message = new StringBuilder();
   // Get curve dividers.
   IList<Curve> divisionCurves = PartUtils.GetSplittingCurves(part.Document, part.Id);
   if (divisionCurves.Count == 0)
      message.AppendLine("Part is not divided.");
   else
   {
      message.AppendLine("The dividers are : ");
      if (divisionCurves.Count > 0)
         message.AppendLine(divisionCurves.Count.ToString() + " division curves");
   }
   TaskDialog.Show("Revit", message.ToString());
}
CopyVB.NET
Public Sub GetCurveDividers(ByVal part As Part)
    Dim message As StringBuilder = New StringBuilder
    ' Get curve dividers.
    Dim divisionCurves As IList(Of Curve) = PartUtils.GetSplittingCurves(part.Document, part.Id)
    If (divisionCurves.Count = 0) Then
        message.AppendLine("Part is not divided.")
    Else
        message.AppendLine("The dividers are : ")
        If (divisionCurves.Count > 0) Then
            message.AppendLine((divisionCurves.Count.ToString + " division curves"))
        End If
    End If
    TaskDialog.Show("Revit", message.ToString)
End Sub
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
PartUtils Class
GetSplittingCurves Overload
Autodesk.Revit.DB Namespace